<?php
$days = ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"];
$month = ['Ян','Фв','Мр','Ап','Ма','Ин','Ию','Ав','Сн','Ок','Но','Дк'];
$i = 1;
$j = 0;
while ($i <= 12) {
    echo $month[$i-1] . "<br>";
    if ((($i % 2 !== 0) && ($i <= 7)) or (($i % 2 == 0) && ($i > 7))) {
        $g = 1;
        while ($g <= 31) {
            if ($j == 7) {
                $j = 0;
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }
            else {
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }

        }
    }
    elseif ($i == 2) {
        $g = 1;
        while ($g <= 28) {
            if ($j == 7) {
                $j = 0;
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }
            else {
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }

        }
    }
    else {
        $g = 1;
        while ($g <= 30) {
            if ($j == 7) {
                $j = 0;
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }
            else {
                echo $g . " " . $days[$j] . " ";
                $g++;
                $j++;
            }

        }
    }
    $i++;
    echo "<br>" . "<br>";
}
